{
  "total_articles": 10,
  "fetched_at": 6560.89,
  "articles": [
    {
      "heading": "US scientists create tiniest autonomous robots, barely visible to the naked eye",
      "summary": "",
      "date": "2025-12-16T11:04:54+00:00",
      "source_link": "https://indianexpress.com/article/technology/science/us-scientists-create-tiniest-autonomous-robots-barely-visible-to-the-naked-eye-10423341/"
    },
    {
      "heading": "'Sena (UBT) and MNS to ally': Sanjay Raut on Maharashtra civic polls; tie-up likely in Mumbai, other major cities",
      "summary": "Estranged cousins Uddhav Thackeray and Raj Thackeray are set to unite their Shiv Sena (UBT) and MNS parties for upcoming civic polls in Mumbai, Thane, Pune, and Nashik. A formal announcement is expected next week, marking a significant political realignment after recent electoral setbacks. This alliance will contest elections in major cities, with local units deciding on tie-ups elsewhere.",
      "date": "2025-12-16T11:01:23+00:00",
      "source_link": "https://timesofindia.indiatimes.com/india/sena-ubt-and-mns-to-ally-sanjay-raut-on-maharashtra-civic-polls-tie-up-likely-in-mumbai-other-major-cities/articleshow/126001464.cms"
    },
    {
      "heading": "What your birth date reveals about your oney Habits; According to Numerology",
      "summary": "Numerology reveals deep-seated money habits tied to birth dates. Your 'Mulank' number, derived from your birthday, highlights financial pitfalls like ego-driven spending (Mulank 1), emotional purchases (Mulank 2), or overconfidence (Mulank 3). Understanding these patterns, from excessive caution (Mulank 4) to impulsive buying (Mulank 5), can lead to balanced financial decisions.",
      "date": "2025-12-16T11:00:26+00:00",
      "source_link": "https://timesofindia.indiatimes.com/astrology/numerology-tarot/what-your-birth-date-reveals-about-your-oney-habits-according-to-numerology/articleshow/126001054.cms"
    },
    {
      "heading": "Messi event fiasco: CM Mamata Banerjee to take sports charge; Aroop Biswas quits ministry",
      "summary": "West Bengal chief minister Mamata Banerjee is reportedly set to take over the state's sports ministry. This follows Sports Minister Aroop Biswas offering to resign amid allegations of mismanagement and security lapses during the Lionel Messi event in Kolkata. The controversy led to spectator anger and damage to stadium property.",
      "date": "2025-12-16T10:59:48+00:00",
      "source_link": "https://timesofindia.indiatimes.com/india/messi-event-fiasco-cm-mamata-banerjee-to-take-sports-charge-aroop-biswas-quits-post/articleshow/126002448.cms"
    },
    {
      "heading": "AIBE 20 result 2025: BCI to release final answer key soon; check details here",
      "summary": "The Bar Council of India is expected to release the AIBE 20 final answer key shortly after the objection window closed on December 10, 2025. This key will be used to prepare the AIBE 20 results, anticipated between January and February 2026, enabling law graduates to receive their Certificate of Practice.",
      "date": "2025-12-16T10:58:29+00:00",
      "source_link": "https://timesofindia.indiatimes.com/education/news/aibe-20-result-2025-bci-to-release-final-answer-key-soon-check-details-here/articleshow/126002491.cms"
    },
    {
      "heading": "IPL Auction: Top 10 most expensive overseas players in history",
      "summary": "Cameron Green has shattered records, becoming the most expensive overseas player in IPL history after being acquired by Kolkata Knight Riders for a staggering Rs 25.20 Crore in the 2026 mini-auction. This highlights the growing value of international talent, with recent seasons witnessing massive bids for players like Mitchell Starc and Pat Cummins, underscoring their impact and versatility.",
      "date": "2025-12-16T10:56:45+00:00",
      "source_link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-auction-top-10-most-expensive-overseas-players-in-history/articleshow/126001719.cms"
    },
    {
      "heading": "Messi Fiasco Fallout: Mamata Banerjee Takes Sports Charge, Cops Get Notice",
      "summary": "Aroop Biswas was seen with Lionel Messi during the event in Kolkata",
      "date": "2025-12-16T10:56:28+00:00",
      "source_link": "https://www.ndtv.com/india-news/bengal-sports-minister-aroop-biswas-resigns-over-chaos-at-lionel-messi-kolkata-event-9824696#publisher=newsstand"
    },
    {
      "heading": "IPL: Who is Izaz Sawariya? 20-year-old spinner makes auction list without pro experience",
      "summary": "Izaz Sawariya, an uncapped spinner, has earned a spot in the IPL 2026 auction solely through his Instagram reels. Despite lacking state or league representation, his bowling videos caught the eye of England's Adil Rashid, leading to interest from IPL franchises like Punjab Kings. This unconventional path highlights the power of social media in discovering new talent.",
      "date": "2025-12-16T10:56:27+00:00",
      "source_link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-who-is-izaz-sawariya-20-year-old-spinner-makes-auction-list-without-pro-experience/articleshow/126000782.cms"
    },
    {
      "heading": "‘We almost got divorced’: Tisca Chopra opens up about co-writing Radhika Apte starrer 'Saali Mohabbat' with husband Sanjay Chopra",
      "summary": "In her directorial OTT debut 'Saali Mohabbat', Tisca Chopra delivers a gripping thriller murder mystery starring Radhika Apte and Divyenndu Sharma. Co-written with her husband, Sanjay Chopra, the \"howdunnit\" explores a web of infidelity and deceit. The actress credits producer Manish Malhotra for guiding her to focus solely on directing this intense thriller.",
      "date": "2025-12-16T10:56:01+00:00",
      "source_link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/tisca-chopra-opens-up-about-co-writing-radhika-apte-starrer-saali-mohabbat-with-husband-sanjay-chopra-we-almost-got-divorced/articleshow/126002122.cms"
    },
    {
      "heading": "'Be it Ananya, Ahaan or Bhavna, it’s been a great year for all the Pandays', says Chunky Panday - Exclusive",
      "summary": "As 2025 nears closure, Chunky Panday looks back on a year packed with family milestones, professional highs, and unexpected moments. From celebrating his children’s achievements to surprising appearances and trademark humour, the actor shares what made the year memorable, what didn’t go as planned, and the madness that kept him smiling.",
      "date": "2025-12-16T10:54:55+00:00",
      "source_link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/be-it-ananya-ahaan-or-bhavna-its-been-a-great-year-for-all-the-pandays-says-chunky-panday-exclusive/articleshow/126002157.cms"
    }
  ]
}
